<a href="https://colab.research.google.com/github/Steve-YJ/data-specialist-from-scratch/blob/TIL-210805-license/SQL_Basics_GROUP_BY_Statement.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL GROUP BY Statement
---
* The SQL GROUP BY Statement
* GROUP BY Syntax
* Demo Database
* referece: [SQL GROUP BY Statement](https://www.w3schools.com/sql/sql_groupby.asp)

## What is GROUP BY Statement?
---
The GROUP BY statement groups rows that have the same values into summary rows, like "find the number of customers in each country".

The GROUP BY statement is often used with aggregate functions (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.

## Demo Database

### Create Database
* demo.db
    * Customer table
*  reference: [SQL sub-queries.ipynb](https://colab.research.google.com/github/lucasmoratof/sql-projects/blob/master/Introduction_to_SQL_sub_queries.ipynb#scrollTo=_xkGEn95uh6W)

In [9]:
import sqlite3

conn = sqlite3.connect("demo.db")  # # To use the module, you must first create a Connection object that represents the database
print("Opened database successfully!")  

conn.execute('''
CREATE TABLE IF NOT EXISTS Customers(
    CustomerID integer,
    CustomerName text,
    ContactName text,
    Address text,
    City text,
    PostalCode integer,
    Country text
);''')

conn.commit() # Save (commit) the changes  // referenced from python docs

print("Table created successfully")

# conn.close()

Opened database successfully!
Table created successfully

In [10]:
# INSERT VALUES

conn.execute("INSERT INTO Customers VALUES(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', 12209, 'Germany');")
conn.execute("INSERT INTO Customers VALUES(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', 05021, 'Mexico');")
# conn.execute("INSERT INTO demo VALUES('');")
# conn.execute("INSERT INTO demo VALUES('');")
# conn.execute("INSERT INTO demo VALUES('');")
# conn.execute("INSERT INTO demo VALUES('');")
# conn.execute("INSERT INTO demo VALUES('');")
# conn.execute("INSERT INTO demo VALUES('');")

In [11]:
cursor = conn.execute("SELECT * FROM customers")

for row in cursor:
    print(row)

# conn.close()

(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', 12209, 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', 5021, 'Mexico')

In [22]:
cursor = conn.execute("""
SELECT *
FROM Customers
WHERE Country = 'Germany'
;""")


for row in cursor:
    print(row)

(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', 12209, 'Germany')

## Examples 
* Origin Sample Code
* from Introduction to SQL sub-queries.ipynb
* [SQL sub-queries.ipynb](https://colab.research.google.com/github/lucasmoratof/sql-projects/blob/master/Introduction_to_SQL_sub_queries.ipynb#scrollTo=L9nIsr9Jwuds)

In [10]:
# CREATING THE TABLE
import sqlite3

conn = sqlite3.connect('test.db'). # To use the module, you must first create a Connection object that represents the database
print("Opened database successfully");

conn.execute('''
CREATE TABLE IF NOT EXISTS team_data(team text, 
                      country text, 
                      season integer, 
                      total_goals integer);''')

conn.commit(). # Save (commit) the changes  // referenced from python docs

print("Table created successfully");

# conn.close()

Opened database successfully
Table created successfully

In [11]:
# INSERTING VALUES

conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2019, 53);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2019, 47);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2019, 52);")
conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2018, 49);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2018, 45);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2018, 50 );")

conn.commit()

In [12]:
# Average goal by team

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team,
                            AVG(total_goals) AS avg_goals
                          FROM team_data
                          GROUP BY team;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Barcelona', 46.0)
('Real Madrid', 51.0)